GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k42.h
// Register: SPI1INTF
#define SPI1INTF SPI1INTF
extern volatile unsigned char           SPI1INTF            __at(0x3D1A);
#ifndef _LIB_BUILD
asm("SPI1INTF equ 03D1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned TXUIF                  :1;
        unsigned RXOIF                  :1;
        unsigned                        :1;
        unsigned EOSIF                  :1;
        unsigned SOSIF                  :1;
        unsigned TCZIF                  :1;
        unsigned SRMTIF                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1TXUIF              :1;
        unsigned SPI1RXOIF              :1;
        unsigned                        :1;
        unsigned SPI1EOSIF              :1;
        unsigned SPI1SOSIF              :1;
        unsigned SPI1TCZIF              :1;
        unsigned SPI1SRMTIF             :1;
    };
} SPI1INTFbits_t;
extern volatile SPI1INTFbits_t SPI1INTFbits __at(0x3D1A);
// bitfield macros
#define _SPI1INTF_TXUIF_POSN                                0x1
#define _SPI1INTF_TXUIF_POSITION                            0x1
#define _SPI1INTF_TXUIF_SIZE                                0x1
#define _SPI1INTF_TXUIF_LENGTH                              0x1
#define _SPI1INTF_TXUIF_MASK                                0x2
#define _SPI1INTF_RXOIF_POSN                                0x2
#define _SPI1INTF_RXOIF_POSITION                            0x2
#define _SPI1INTF_RXOIF_SIZE                                0x1
#define _SPI1INTF_RXOIF_LENGTH                              0x1
#define _SPI1INTF_RXOIF_MASK                                0x4
#define _SPI1INTF_EOSIF_POSN                                0x4
#define _SPI1INTF_EOSIF_POSITION                            0x4
#define _SPI1INTF_EOSIF_SIZE                                0x1
#define _SPI1INTF_EOSIF_LENGTH                              0x1
#define _SPI1INTF_EOSIF_MASK                                0x10
#define _SPI1INTF_SOSIF_POSN                                0x5
#define _SPI1INTF_SOSIF_POSITION                            0x5
#define _SPI1INTF_SOSIF_SIZE                                0x1
#define _SPI1INTF_SOSIF_LENGTH                              0x1
#define _SPI1INTF_SOSIF_MASK                                0x20
#define _SPI1INTF_TCZIF_POSN                                0x6
#define _SPI1INTF_TCZIF_POSITION                            0x6
#define _SPI1INTF_TCZIF_SIZE                                0x1
#define _SPI1INTF_TCZIF_LENGTH                              0x1
#define _SPI1INTF_TCZIF_MASK                                0x40
#define _SPI1INTF_SRMTIF_POSN                               0x7
#define _SPI1INTF_SRMTIF_POSITION                           0x7
#define _SPI1INTF_SRMTIF_SIZE                               0x1
#define _SPI1INTF_SRMTIF_LENGTH                             0x1
#define _SPI1INTF_SRMTIF_MASK                               0x80
#define _SPI1INTF_SPI1TXUIF_POSN                            0x1
#define _SPI1INTF_SPI1TXUIF_POSITION                        0x1
#define _SPI1INTF_SPI1TXUIF_SIZE                            0x1
#define _SPI1INTF_SPI1TXUIF_LENGTH                          0x1
#define _SPI1INTF_SPI1TXUIF_MASK                            0x2
#define _SPI1INTF_SPI1RXOIF_POSN                            0x2
#define _SPI1INTF_SPI1RXOIF_POSITION                        0x2
#define _SPI1INTF_SPI1RXOIF_SIZE                            0x1
#define _SPI1INTF_SPI1RXOIF_LENGTH                          0x1
#define _SPI1INTF_SPI1RXOIF_MASK                            0x4
#define _SPI1INTF_SPI1EOSIF_POSN                            0x4
#define _SPI1INTF_SPI1EOSIF_POSITION                        0x4
#define _SPI1INTF_SPI1EOSIF_SIZE                            0x1
#define _SPI1INTF_SPI1EOSIF_LENGTH                          0x1
#define _SPI1INTF_SPI1EOSIF_MASK                            0x10
#define _SPI1INTF_SPI1SOSIF_POSN                            0x5
#define _SPI1INTF_SPI1SOSIF_POSITION                        0x5
#define _SPI1INTF_SPI1SOSIF_SIZE                            0x1
#define _SPI1INTF_SPI1SOSIF_LENGTH                          0x1
#define _SPI1INTF_SPI1SOSIF_MASK                            0x20
#define _SPI1INTF_SPI1TCZIF_POSN                            0x6
#define _SPI1INTF_SPI1TCZIF_POSITION                        0x6
#define _SPI1INTF_SPI1TCZIF_SIZE                            0x1
#define _SPI1INTF_SPI1TCZIF_LENGTH                          0x1
#define _SPI1INTF_SPI1TCZIF_MASK                            0x40
#define _SPI1INTF_SPI1SRMTIF_POSN                           0x7
#define _SPI1INTF_SPI1SRMTIF_POSITION                       0x7
#define _SPI1INTF_SPI1SRMTIF_SIZE                           0x1
#define _SPI1INTF_SPI1SRMTIF_LENGTH                         0x1
#define _SPI1INTF_SPI1SRMTIF_MASK                           0x80

// Register: SPI1INTE
#define SPI1INTE SPI1INTE
extern volatile unsigned char           SPI1INTE            __at(0x3D1B);
#ifndef _LIB_BUILD
asm("SPI1INTE equ 03D1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned TXUIE                  :1;
        unsigned RXOIE                  :1;
        unsigned                        :1;
        unsigned EOSIE                  :1;
        unsigned SOSIE                  :1;
        unsigned TCZIE                  :1;
        unsigned SRMTIE                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1TXUIE              :1;
        unsigned SPI1RXOIE              :1;
        unsigned                        :1;
        unsigned SPI1EOSIE              :1;
        unsigned SPI1SOSIE              :1;
        unsigned SPI1TCZIE              :1;
        unsigned SPI1SRMTIE             :1;
    };
} SPI1INTEbits_t;
extern volatile SPI1INTEbits_t SPI1INTEbits __at(0x3D1B);
// bitfield macros
#define _SPI1INTE_TXUIE_POSN                                0x1
#define _SPI1INTE_TXUIE_POSITION                            0x1
#define _SPI1INTE_TXUIE_SIZE                                0x1
#define _SPI1INTE_TXUIE_LENGTH                              0x1
#define _SPI1INTE_TXUIE_MASK                                0x2
#define _SPI1INTE_RXOIE_POSN                                0x2
#define _SPI1INTE_RXOIE_POSITION                            0x2
#define _SPI1INTE_RXOIE_SIZE                                0x1
#define _SPI1INTE_RXOIE_LENGTH                              0x1
#define _SPI1INTE_RXOIE_MASK                                0x4
#define _SPI1INTE_EOSIE_POSN                                0x4
#define _SPI1INTE_EOSIE_POSITION                            0x4
#define _SPI1INTE_EOSIE_SIZE                                0x1
#define _SPI1INTE_EOSIE_LENGTH                              0x1
#define _SPI1INTE_EOSIE_MASK                                0x10
#define _SPI1INTE_SOSIE_POSN                                0x5
#define _SPI1INTE_SOSIE_POSITION                            0x5
#define _SPI1INTE_SOSIE_SIZE                                0x1
#define _SPI1INTE_SOSIE_LENGTH                              0x1
#define _SPI1INTE_SOSIE_MASK                                0x20
#define _SPI1INTE_TCZIE_POSN                                0x6
#define _SPI1INTE_TCZIE_POSITION                            0x6
#define _SPI1INTE_TCZIE_SIZE                                0x1
#define _SPI1INTE_TCZIE_LENGTH                              0x1
#define _SPI1INTE_TCZIE_MASK                                0x40
#define _SPI1INTE_SRMTIE_POSN                               0x7
#define _SPI1INTE_SRMTIE_POSITION                           0x7
#define _SPI1INTE_SRMTIE_SIZE                               0x1
#define _SPI1INTE_SRMTIE_LENGTH                             0x1
#define _SPI1INTE_SRMTIE_MASK                               0x80
#define _SPI1INTE_SPI1TXUIE_POSN                            0x1
#define _SPI1INTE_SPI1TXUIE_POSITION                        0x1
#define _SPI1INTE_SPI1TXUIE_SIZE                            0x1
#define _SPI1INTE_SPI1TXUIE_LENGTH                          0x1
#define _SPI1INTE_SPI1TXUIE_MASK                            0x2
#define _SPI1INTE_SPI1RXOIE_POSN                            0x2
#define _SPI1INTE_SPI1RXOIE_POSITION                        0x2
#define _SPI1INTE_SPI1RXOIE_SIZE                            0x1
#define _SPI1INTE_SPI1RXOIE_LENGTH                          0x1
#define _SPI1INTE_SPI1RXOIE_MASK                            0x4
#define _SPI1INTE_SPI1EOSIE_POSN                            0x4
#define _SPI1INTE_SPI1EOSIE_POSITION                        0x4
#define _SPI1INTE_SPI1EOSIE_SIZE                            0x1
#define _SPI1INTE_SPI1EOSIE_LENGTH                          0x1
#define _SPI1INTE_SPI1EOSIE_MASK                            0x10
#define _SPI1INTE_SPI1SOSIE_POSN                            0x5
#define _SPI1INTE_SPI1SOSIE_POSITION                        0x5
#define _SPI1INTE_SPI1SOSIE_SIZE                            0x1
#define _SPI1INTE_SPI1SOSIE_LENGTH                          0x1
#define _SPI1INTE_SPI1SOSIE_MASK                            0x20
#define _SPI1INTE_SPI1TCZIE_POSN                            0x6
#define _SPI1INTE_SPI1TCZIE_POSITION                        0x6
#define _SPI1INTE_SPI1TCZIE_SIZE                            0x1
#define _SPI1INTE_SPI1TCZIE_LENGTH                          0x1
#define _SPI1INTE_SPI1TCZIE_MASK                            0x40
#define _SPI1INTE_SPI1SRMTIE_POSN                           0x7
#define _SPI1INTE_SPI1SRMTIE_POSITION                       0x7
#define _SPI1INTE_SPI1SRMTIE_SIZE                           0x1
#define _SPI1INTE_SPI1SRMTIE_LENGTH                         0x1
#define _SPI1INTE_SPI1SRMTIE_MASK                           0x80

// Register: SPI1CLK
#define SPI1CLK SPI1CLK
extern volatile unsigned char           SPI1CLK             __at(0x3D1C);
#ifndef _LIB_BUILD
asm("SPI1CLK equ 03D1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLKSEL                 :8;
    };
    struct {
        unsigned CLKSEL0                :1;
        unsigned CLKSEL1                :1;
        unsigned CLKSEL2                :1;
        unsigned CLKSEL3                :1;
    };
    struct {
        unsigned SPI1CLKSEL             :8;
    };
    struct {
        unsigned SPI1CLKSEL0            :1;
        unsigned SPI1CLKSEL1            :1;
        unsigned SPI1CLKSEL2            :1;
        unsigned SPI1CLKSEL3            :1;
    };
} SPI1CLKbits_t;
extern volatile SPI1CLKbits_t SPI1CLKbits __at(0x3D1C);
// bitfield macros
#define _SPI1CLK_CLKSEL_POSN                                0x0
#define _SPI1CLK_CLKSEL_POSITION                            0x0
#define _SPI1CLK_CLKSEL_SIZE                                0x8
#define _SPI1CLK_CLKSEL_LENGTH                              0x8
#define _SPI1CLK_CLKSEL_MASK                                0xFF
#define _SPI1CLK_CLKSEL0_POSN                               0x0
#define _SPI1CLK_CLKSEL0_POSITION                           0x0
#define _SPI1CLK_CLKSEL0_SIZE                               0x1
#define _SPI1CLK_CLKSEL0_LENGTH                             0x1
#define _SPI1CLK_CLKSEL0_MASK                               0x1
#define _SPI1CLK_CLKSEL1_POSN                               0x1
#define _SPI1CLK_CLKSEL1_POSITION                           0x1
#define _SPI1CLK_CLKSEL1_SIZE                               0x1
#define _SPI1CLK_CLKSEL1_LENGTH                             0x1
#define _SPI1CLK_CLKSEL1_MASK                               0x2
#define _SPI1CLK_CLKSEL2_POSN                               0x2
#define _SPI1CLK_CLKSEL2_POSITION                           0x2
#define _SPI1CLK_CLKSEL2_SIZE                               0x1
#define _SPI1CLK_CLKSEL2_LENGTH                             0x1
#define _SPI1CLK_CLKSEL2_MASK                               0x4
#define _SPI1CLK_CLKSEL3_POSN                               0x3
#define _SPI1CLK_CLKSEL3_POSITION                           0x3
#define _SPI1CLK_CLKSEL3_SIZE                               0x1
#define _SPI1CLK_CLKSEL3_LENGTH                             0x1
#define _SPI1CLK_CLKSEL3_MASK                               0x8
#define _SPI1CLK_SPI1CLKSEL_POSN                            0x0
#define _SPI1CLK_SPI1CLKSEL_POSITION                        0x0
#define _SPI1CLK_SPI1CLKSEL_SIZE                            0x8
#define _SPI1CLK_SPI1CLKSEL_LENGTH                          0x8
#define _SPI1CLK_SPI1CLKSEL_MASK                            0xFF
#define _SPI1CLK_SPI1CLKSEL0_POSN                           0x0
#define _SPI1CLK_SPI1CLKSEL0_POSITION                       0x0
#define _SPI1CLK_SPI1CLKSEL0_SIZE                           0x1
#define _SPI1CLK_SPI1CLKSEL0_LENGTH                         0x1
#define _SPI1CLK_SPI1CLKSEL0_MASK                           0x1
#define _SPI1CLK_SPI1CLKSEL1_POSN                           0x1
#define _SPI1CLK_SPI1CLKSEL1_POSITION                       0x1
#define _SPI1CLK_SPI1CLKSEL1_SIZE                           0x1
#define _SPI1CLK_SPI1CLKSEL1_LENGTH                         0x1
#define _SPI1CLK_SPI1CLKSEL1_MASK                           0x2
#define _SPI1CLK_SPI1CLKSEL2_POSN                           0x2
#define _SPI1CLK_SPI1CLKSEL2_POSITION                       0x2
#define _SPI1CLK_SPI1CLKSEL2_SIZE                           0x1
#define _SPI1CLK_SPI1CLKSEL2_LENGTH                         0x1
#define _SPI1CLK_SPI1CLKSEL2_MASK                           0x4
#define _SPI1CLK_SPI1CLKSEL3_POSN                           0x3
#define _SPI1CLK_SPI1CLKSEL3_POSITION                       0x3
#define _SPI1CLK_SPI1CLKSEL3_SIZE                           0x1
#define _SPI1CLK_SPI1CLKSEL3_LENGTH                         0x1
#define _SPI1CLK_SPI1CLKSEL3_MASK                           0x8

// Register: I2C2RXB
#define I2C2RXB I2C2RXB
extern volatile unsigned char           I2C2RXB             __at(0x3D54);
#ifndef _LIB_BUILD
asm("I2C2RXB equ 03D54h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} I2C2RXBbits_t;
extern volatile I2C2RXBbits_t I2C2RXBbits __at(0x3D54);
// bitfield macros
#define _I2C2RXB_RXB_POSN                                   0x0
#define _I2C2RXB_RXB_POSITION                               0x0
#define _I2C2RXB_RXB_SIZE                                   0x8
#define _I2C2RXB_RXB_LENGTH                                 0x8
#define _I2C2RXB_RXB_MASK                                   0xFF

// Register: I2C2TXB
#define I2C2TXB I2C2TXB
extern volatile unsigned char           I2C2TXB             __at(0x3D55);
#ifndef _LIB_BUILD
asm("I2C2TXB equ 03D55h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} I2C2TXBbits_t;
extern volatile I2C2TXBbits_t I2C2TXBbits __at(0x3D55);
// bitfield macros
#define _I2C2TXB_TXB_POSN                                   0x0
#define _I2C2TXB_TXB_POSITION                               0x0
#define _I2C2TXB_TXB_SIZE                                   0x8
#define _I2C2TXB_TXB_LENGTH                                 0x8
#define _I2C2TXB_TXB_MASK                                   0xFF

// Register: I2C2CNT
#define I2C2CNT I2C2CNT
extern volatile unsigned char           I2C2CNT             __at(0x3D56);
#ifndef _LIB_BUILD
asm("I2C2CNT equ 03D56h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CNT                    :8;
    };
    struct {
        unsigned CNT0                   :1;
        unsigned CNT1                   :1;
        unsigned CNT2                   :1;
        unsigned CNT3                   :1;
        unsigned CNT4                   :1;
        unsigned CNT5                   :1;
        unsigned CNT6                   :1;
        unsigned CNT7                   :1;
    };
} I2C2CNTbits_t;
extern volatile I2C2CNTbits_t I2C2CNTbits __at(0x3D56);
// bitfield macros
#define _I2C2CNT_CNT_POSN                                   0x0
#define _I2C2CNT_CNT_POSITION                               0x0
#define _I2C2CNT_CNT_SIZE                                   0x8
#define _I2C2CNT_CNT_LENGTH                                 0x8
#define _I2C2CNT_CNT_MASK                                   0xFF
#define _I2C2CNT_CNT0_POSN                                  0x0
#define _I2C2CNT_CNT0_POSITION                              0x0
#define _I2C2CNT_CNT0_SIZE                                  0x1
#define _I2C2CNT_CNT0_LENGTH                                0x1
#define _I2C2CNT_CNT0_MASK                                  0x1
#define _I2C2CNT_CNT1_POSN                                  0x1
#define _I2C2CNT_CNT1_POSITION                              0x1
#define _I2C2CNT_CNT1_SIZE                                  0x1
#define _I2C2CNT_CNT1_LENGTH                                0x1
#define _I2C2CNT_CNT1_MASK                                  0x2
#define _I2C2CNT_CNT2_POSN                                  0x2
#define _I2C2CNT_CNT2_POSITION                              0x2
#define _I2C2CNT_CNT2_SIZE                                  0x1
#define _I2C2CNT_CNT2_LENGTH                                0x1
#define _I2C2CNT_CNT2_MASK                                  0x4
#define _I2C2CNT_CNT3_POSN                                  0x3
#define _I2C2CNT_CNT3_POSITION                              0x3
#define _I2C2CNT_CNT3_SIZE                                  0x1
#define _I2C2CNT_CNT3_LENGTH                                0x1
#define _I2C2CNT_CNT3_MASK                                  0x8
#define _I2C2CNT_CNT4_POSN                                  0x4
#define _I2C2CNT_CNT4_POSITION                              0x4
#define _I2C2CNT_CNT4_SIZE                                  0x1
#define _I2C2CNT_CNT4_LENGTH                                0x1
#define _I2C2CNT_CNT4_MASK                                  0x10
#define _I2C2CNT_CNT5_POSN                                  0x5
#define _I2C2CNT_CNT5_POSITION                              0x5
#define _I2C2CNT_CNT5_SIZE                                  0x1
#define _I2C2CNT_CNT5_LENGTH                                0x1
#define _I2C2CNT_CNT5_MASK                                  0x20
#define _I2C2CNT_CNT6_POSN                                  0x6
#define _I2C2CNT_CNT6_POSITION                              0x6
#define _I2C2CNT_CNT6_SIZE                                  0x1
#define _I2C2CNT_CNT6_LENGTH                                0x1
#define _I2C2CNT_CNT6_MASK                                  0x40
#define _I2C2CNT_CNT7_POSN                                  0x7
#define _I2C2CNT_CNT7_POSITION                              0x7
#define _I2C2CNT_CNT7_SIZE                                  0x1
#define _I2C2CNT_CNT7_LENGTH                                0x1
#define _I2C2CNT_CNT7_MASK                                  0x80

// Register: I2C2ADB0
#define I2C2ADB0 I2C2ADB0
extern volatile unsigned char           I2C2ADB0            __at(0x3D57);
#ifndef _LIB_BUILD
asm("I2C2ADB0 equ 03D57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADB                    :8;
    };
} I2C2ADB0bits_t;
extern volatile I2C2ADB0bits_t I2C2ADB0bits __at(0x3D57);
// bitfield macros
#define _I2C2ADB0_ADB_POSN                                  0x0
#define _I2C2ADB0_ADB_POSITION                              0x0
#define _I2C2ADB0_ADB_SIZE                                  0x8
#define _I2C2ADB0_ADB_LENGTH                                0x8
#define _I2C2ADB0_ADB_MASK                                  0xFF

